Revit 2027 API
ExtensibleStorageFilter Constructor
 Constructs a new instance of a filter to match elements with extensible storage data based on specific Schema id.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExtensibleStorageFilter(
	Guid schemaGuid
)
Public Sub New (
	schemaGuid As Guid
)
public:
ExtensibleStorageFilter(
	Guid schemaGuid
)
new :
        schemaGuid : Guid -> ExtensibleStorageFilter
Parameters
schemaGuid Guid
 Schema id used to filter elements with extensible storage data
See Also
Reference
ExtensibleStorageFilter Class
Autodesk.Revit.DB.ExtensibleStorage Namespace